IDEA StatiCa Open Model
Member1DType Enumeration
Compatible with IDEA StatiCa Beta 21.0 - beta
 Type of Member 1D
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public enum Member1DType
Public Enumeration Member1DType
public enum class Member1DType
Members
Member name | Value | Description
Beam | 0 |  Beam member
Column | 1 |  Column member
Truss | 2 |  Truss member
Rib | 3 |  Rib member
BeamSlab | 4 |  Beam slab, rcs element
See Also
Reference
IdeaRS.OpenModel.Model Namespace